NNModel(
  (linears): ModuleList(
    (0): Linear(in_features=45, out_features=256, bias=True)
    (1-3): 3 x Linear(in_features=256, out_features=256, bias=True)
  )
  (fc_final): Linear(in_features=256, out_features=1, bias=True)
)